var categories = {
	A: "ニュース・報道",
	B: "スポーツ",
	C: "情報・ワイドショー",
	D: "ドラマ",
	E: "音楽",
	F: "バラエティ",
	G: "映画",
	H: "アニメ",
	I: "ドキュメンタリー",
	J: "劇場・公演",
	K: "趣味・教育",
	L: "福祉",
	P: "その他"
};

var sub_categories = {
	A: {
		A: "定時・総合",
		B: "天気",
		C: "特集・ドキュメント",
		D: "政治・国会",
		E: "経済・市況",
		F: "海外・国際",
		G: "解説",
		H: "討論・会談",
		I: "報道特番",
		J: "ローカル・地域",
		K: "交通",
		P: "その他"
	},
	B: {
		A: "スポーツニュース",
		B: "野球",
		C: "サッカー",
		D: "ゴルフ",
		E: "その他の球技",
		F: "相撲・格闘技",
		G: "オリンピック・国際大会",
		H: "マラソン・陸上・水泳",
		I: "モータースポーツ",
		J: "マリン・ウィンタースポーツ",
		K: "競馬・公営競技",
		P: "その他"
	},
	C: {
		A: "芸能・ワイドショー",
		B: "ファッション",
		C: "暮らし・住まい",
		D: "健康・医療",
		E: "ショッピング・通販",
		F: "グルメ・料理",
		G: "イベント",
		H: "番組紹介・お知らせ",
		P: "その他"
	},
	D: {
		A: "国内ドラマ",
		B: "海外ドラマ",
		C: "時代劇",
		P: "その他"
	},
	E: {
		A: "国内ロック・ポップス",
		B: "海外ロック・ポップス",
		C: "クラシック・オペラ",
		D: "ジャズ・フュージョン",
		E: "歌謡曲・演歌",
		F: "ライブ・コンサート",
		G: "ランキング・リクエスト",
		H: "カラオケ・のど自慢",
		I: "民謡・邦楽",
		J: "童謡・キッズ",
		K: "民族音楽・ワールドミュージック",
		P: "その他"
	},
	F: {
		A: "クイズ",
		B: "ゲーム",
		C: "トークバラエティ",
		D: "お笑い・コメディ",
		E: "音楽バラエティ",
		F: "旅バラエティ",
		G: "料理バラエティ",
		P: "その他"
	},
	G: {
		A: "洋画",
		B: "邦画",
		C: "アニメ",
		P: "その他"
	},
	H: {
		A: "国内アニメ",
		B: "海外アニメ",
		C: "特撮",
		P: "その他"
	},
	I: {
		A: "社会・時事",
		B: "歴史・紀行",
		C: "自然・動物・環境",
		D: "宇宙・科学・医学",
		E: "カルチャー・伝統文化",
		F: "文学・文芸",
		G: "スポーツ",
		H: "ドキュメンタリー全般",
		I: "インタビュー・討論",
		P: "その他"
	},
	J: {
		A: "現代劇・新劇",
		B: "ミュージカル",
		C: "ダンス・バレエ",
		D: "落語・演芸",
		E: "歌舞伎・古典",
		P: "その他"
	},
	K: {
		A: "旅・釣り・アウトドア",
		B: "園芸・ペット・手芸",
		C: "音楽・美術・工芸",
		D: "囲碁・将棋",
		E: "麻雀・パチンコ",
		F: "車・オートバイ",
		G: "コンピュータ・ＴＶゲーム",
		H: "会話・語学",
		I: "幼児・小学生",
		J: "中学生・高校生",
		K: "大学生・受験",
		L: "生涯教育・資格",
		M: "教育問題",
		P: "その他"
	},
	L: {
		A: "高齢者",
		B: "障害者",
		C: "社会福祉",
		D: "ボランティア",
		E: "手話",
		F: "文字（字幕）",
		G: "音声解説",
		P: "その他"
	},
	P: {
		P: "その他"
	}
};
